# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this US_Baby_Names_right.csv

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv('US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [4]:
baby_names.head(11)

    Unnamed: 0     Id      Name  Year Gender State  Count
0        11349  11350      Emma  2004      F    AK     62
1        11350  11351   Madison  2004      F    AK     48
2        11351  11352    Hannah  2004      F    AK     46
3        11352  11353     Grace  2004      F    AK     44
4        11353  11354     Emily  2004      F    AK     41
5        11354  11355   Abigail  2004      F    AK     37
6        11355  11356    Olivia  2004      F    AK     33
7        11356  11357  Isabella  2004      F    AK     30
8        11357  11358    Alyssa  2004      F    AK     29
9        11358  11359    Sophia  2004      F    AK     28
10       11359  11360    Alexis  2004      F    AK     27

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby_names = baby_names.drop(['Unnamed: 0', 'Id'], axis = 1)

### Step 6. Is there more male or female names in the dataset?

In [6]:
baby_names['Gender'].value_counts('M')

F    0.549832
M    0.450168
Name: Gender, dtype: float64

### Step 7. Group the dataset by name and assign to names

In [17]:
names = baby_names.groupby('Name').sum()
#Al principio no lo hab√≠a sumado.

In [18]:
names.head()

           Year  Count
Name
Aaban      4027     12
Aadan      8039     23
Aadarsh    2009      5
Aaden    393963   3426
Aadhav     2014      6

### Step 8. How many different names exist in the dataset?

In [19]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [20]:
names.Count.idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [21]:
len(names[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [22]:
names.median()

Year     16061.0
Count       49.0
dtype: float64

### Step 12. What is the standard deviation of names?

In [24]:
names.std()

Year     245161.817178
Count     11006.069468
dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [25]:
names.describe()

               Year          Count
count  1.763200e+04   17632.000000
mean   1.158117e+05    2008.932169
std    2.451618e+05   11006.069468
min    2.004000e+03       5.000000
25%    4.017000e+03      11.000000
50%    1.606100e+04      49.000000
75%    7.846425e+04     337.000000
max    2.233993e+06  242874.000000